# 작업1유형

### 유튜브 인기동영상 데이터

In [1]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/youtube.csv',index_col=0)
df.head()

,title,channelTitle,categoryId,view_count,likes,dislikes,comment_count,channelId,trending_date2
0,[신병] 물자창고,장삐쭈,23,1893473,38249,730,8595,UChbE5OZQ6dRHECsX0tEPEZQ,2021-01-01
1,RAIN(비) - 나로 바꾸자 Switch to me (duet with JYP) MV,RAIN's Official Channel,10,2600864,0,0,20129,UCxXgIeE5hxWxHG6dz9Scg2w,2021-01-01
2,2020년 제야의 종 온라인 타종행사 | 보신각 현장 행사는 진행하지 않습니다.,서울시 · Seoul,29,347049,3564,120,178,UCZUPZW5idAxYp-Asj__lVAA,2021-01-01
3,고기남자의 칠면조 파티,고기남자 MeatMan,26,528458,15372,280,3470,UCT3CumbFIJiW33uq0UI3zlg,2021-01-01
4,골목 3mc를 분노하게 만든 마음고생이 심했을 공릉 백반집 사장님의 푸념?! [예능...,스브스밥집,24,494904,3918,111,3142,UCdWgRSfttvDucq4ApcCg5Mw,2021-01-01

In [198]:
# 1 
list(df[df.channelId.isin(df.channelId.value_counts().head(10).index)].channelTitle.unique())

['장삐쭈',
 '총몇명',
 '파뿌리',
 '짤툰',
 '런닝맨 - 스브스 공식 채널',
 '엠뚜루마뚜루 : MBC 공식 종합 채널',
 'SPOTV',
 '채널 십오야',
 '이과장',
 'BANGTANTV']

In [199]:
# 2 
list(df[df.likes < df.dislikes].channelTitle.unique())

['핫도그TV',
 'ASMR 애정TV',
 '하얀트리HayanTree',
 '양팡 YangPang',
 '철구형 (CHULTUBE)',
 '왜냐맨하우스',
 '(MUTUBE)와꾸대장봉준',
 '오메킴TV',
 '육지담',
 'MapleStory_KR',
 'ROAD FIGHTING CHAMPIONSHIP',
 '사나이 김기훈',
 '나혼자산다 STUDIO',
 'Gen.G esports']

In [200]:
# 3 
change = df[['channelId', 'channelTitle']].drop_duplicates().channelId.value_counts()
len(change[change > 1] )

71

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60399 entries, 0 to 60398
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           60399 non-null  object
 1   channelTitle    60399 non-null  object
 2   categoryId      60399 non-null  int64
 3   view_count      60399 non-null  int64
 4   likes           60399 non-null  int64
 5   dislikes        60399 non-null  int64
 6   comment_count   60399 non-null  int64
 7   channelId       60399 non-null  object
 8   trending_date2  60399 non-null  object
dtypes: int64(5), object(4)
memory usage: 4.6+ MB

In [202]:
# 4 
df_weekday = df[pd.to_datetime(df.trending_date2).dt.weekday == 6]
df_weekday.categoryId.value_counts().index[0]

df_weekday = df[pd.to_datetime(df.trending_date2).dt.day_name()== 'Sunday']
df_weekday.categoryId.value_counts().index[0]

24

In [203]:
# 5 
df_copy = df.copy()
df_copy['weekday'] = pd.to_datetime(df.trending_date2).dt.day_name()
df_copy.pivot_table(index = 'categoryId', columns='weekday', aggfunc='size') 
# df.groupby(['categoryId', pd.to_datetime(df.trending_date2).dt.day_name()]).size().unstack()

weekday     Friday  Monday  Saturday  Sunday  Thursday  Tuesday  Wednesday
categoryId
1              243     263       255     274       246      257        234
2              120     105       119      99       128      119        129
10             833     837       776     830       890      894        917
15             187     215       198     217       207      208        207
17             633     668       592     636       682      708        706
19              90      92        87      91        92       89         85
20             283     298       296     289       282      285        291
22            1288    1373      1289    1337      1341     1375       1333
23             568     594       570     556       560      569        566
24            2976    3148      3066    3096      2954     3084       3090
25             444     453       422     437       470      452        468
26             369     378       364     363       375      394        385
27             183     205       183     199       194      194        212
28             171     160       173     167       166      161        165
29              12      10        10       9        13       11         12

In [170]:
# 6 
target = df[df['view_count'] != 0]
t = target.copy()
t['comment_view'] = (t['comment_count']/t['view_count']).dropna()
t.sort_values(by='comment_view').tail(1).title

50830    60분 동안 댓글이 달리지 않으면, 영상이 삭제됩니다. (챌린지)
Name: title, dtype: object

In [205]:
# 7 
target = df[df['view_count'] != 0]
t = target.copy()
t['ratio'] = (t['comment_count']/t['view_count']).dropna()
t[t['ratio'] != 0]
t.sort_values(by='ratio')
t.sort_values(by='ratio').head(1).title

50071    After We Ride (술버릇 (운전만해 그후))
Name: title, dtype: object

In [206]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60399 entries, 0 to 60398
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           60399 non-null  object
 1   channelTitle    60399 non-null  object
 2   categoryId      60399 non-null  int64
 3   view_count      60399 non-null  int64
 4   likes           60399 non-null  int64
 5   dislikes        60399 non-null  int64
 6   comment_count   60399 non-null  int64
 7   channelId       60399 non-null  object
 8   trending_date2  60399 non-null  object
dtypes: int64(5), object(4)
memory usage: 4.6+ MB

In [215]:
# 8 
# target = df[(df['likes'] != 0) & (df['dislikes'] != 0)] 
# target['ratio'] = target['dislikes']/target['likes']
# target.sort_values(by='ratio').head(1).title

target = df[(df['likes'] != 0) & (df['dislikes'] != 0)]
idx = (target['dislikes']/target['likes']).sort_values().index[0]
df.iloc[idx].title

'[줌터뷰] *최초공개* 사부작즈🐰🐶의 비공식 이름은 아이라인즈? 꿀조합 티키타카 가득한 NCT 127 도영&정우의 줌터뷰'

In [229]:
# 9 
# df.channelTitle.value_counts().head(1).index

df[df.channelId == df.channelId.value_counts().head(1).index[0]].channelTitle.unique()[0]

'짤툰'

In [238]:
# 10 
target = df.title.value_counts() 
len(target[target >= 20])

41

### 유튜브 공범컨텐츠 동영상 데이터

In [239]:
channel =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/channelInfo.csv')
video =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/videoInfo.csv')
display(channel.head())
display(video.head())

,channelid,subcnt,viewcnt,videocnt,ct,channelname
0,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,410238653,736,2021-09-30 03:01:03,꽈뚜룹
1,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,736,2021-09-30 09:01:03,꽈뚜룹
2,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,735,2021-09-30 15:01:03,꽈뚜룹
3,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,737,2021-09-30 21:01:03,꽈뚜룹
4,UCkQCwnkQfgSuPTTnw_Y7v7w,1320000,412531322,737,2021-10-01 03:01:04,꽈뚜룹

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1

In [242]:
# 11 
channel['ct'] = pd.to_datetime(channel['ct'])
video['ct'] = pd.to_datetime(video['ct'])
video['videoname'].value_counts()

videoname
 공범 EP1    3492
 공범 EP2    3204
 공범 EP3    2568
 공범 EP4    2280
 공범 EP5    1562
 공범 EP6    1274
 공범 EP7     555
 공범 EP8     266
Name: count, dtype: int64

In [247]:
# 12 
video.sort_values(['videoname','ct']).drop_duplicates('videoname', keep='last')[['viewcnt','videoname','ct']]

       viewcnt videoname                  ct
3491   3180532    공범 EP1 2021-11-01 15:30:03
6695   2199328    공범 EP2 2021-11-01 15:30:03
9263   1671294    공범 EP3 2021-11-01 15:30:03
11543  1818493    공범 EP4 2021-11-01 15:30:03
13105  1503435    공범 EP5 2021-11-01 15:30:04
14934  1750222    공범 EP6 2021-11-01 15:30:04
13660  1630200    공범 EP7 2021-11-01 15:30:05
15200  1289088    공범 EP8 2021-11-01 15:30:05

In [262]:
# 13
channel[channel['ct'] >= pd.to_datetime('2021-10-03')].drop_duplicates('channelname',keep='first')[['channelname','subcnt']]

          channelname   subcnt
12                꽈뚜룹  1330000
139             야전삽짱재   257000
266        츄정ChuJeong   322000
393            논리왕 전기   922000
520   와글와글 WagleWagle    55000
647               조나단   215000
774           형사!탐정되다    14900
901        김농밀의 농밀한 삶     7520
1028      릴펄 Lilpearl    10100
1155    곽토리 kwak tori   471000
1276    Balming Tiger    54300

In [286]:
# 14
df1 = channel[(channel['ct'] >= '2021-10-03 03:00:00') & (channel['ct'] <= '2021-11-01 15:00:00')].drop_duplicates('channelname')[['channelname', 'subcnt']]
df2 = channel[(channel['ct'] >= '2021-10-03 03:00:00') & (channel['ct'] <= '2021-11-01 15:00:00')].drop_duplicates('channelname', keep='last')[['channelname', 'subcnt']]
df1.rename(columns={'subcnt': 'subcnt_first'}, inplace=True)
df2.rename(columns={'subcnt': 'subcnt_last'}, inplace=True)

target = pd.merge(df1,df2)

target['del'] = target['subcnt_last'] - target['subcnt_first']

target[['channelname','del']]

        channelname    del
0               꽈뚜룹  70000
1             야전삽짱재  11000
2        츄정ChuJeong   1000
3            논리왕 전기 -11000
4   와글와글 WagleWagle      0
5               조나단  12000
6           형사!탐정되다  10300
7        김농밀의 농밀한 삶   1540
8       릴펄 Lilpearl  11000
9     곽토리 kwak tori  -2000
10    Balming Tiger   2500

In [290]:
video

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1
...,...,...,...,...,...,...,...,...
15196,yZt-h-KcmUE,1285474,25582,3615,0,31603,2021-11-01 14:50:06,공범 EP8
15197,yZt-h-KcmUE,1286376,25592,3617,0,31627,2021-11-01 15:00:05,공범 EP8
15198,yZt-h-KcmUE,1287172,25597,3619,0,31643,2021-11-01 15:10:05,공범 EP8
15199,yZt-h-KcmUE,1288138,25606,3619,0,31648,2021-11-01 15:20:04,공범 EP8
15200,yZt-h-KcmUE,1289088,25616,3621,0,31663,2021-11-01 15:30:05,공범 EP8

In [349]:
# 15
video_EP1  = video[video['videoname'] == ' 공범 EP1'].sort_values('ct')
con1 = video_EP1.ct.diff(1) <= pd.Timedelta('00:05:00') 
con2 = video_EP1.ct.diff(1) >= pd.Timedelta('00:20:00') 
video_EP1[con1 | con2].index 

video_EP1.iloc[[720,721,722,723,1635,1636,1637]]

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
720,c5JQp6xafqc,2153676,34104,830,0,7120,2021-10-12 19:20:03,공범 EP1
721,c5JQp6xafqc,2228250,34559,849,0,7191,2021-10-13 09:41:37,공범 EP1
722,c5JQp6xafqc,2228250,34559,849,0,7191,2021-10-13 09:41:37,공범 EP1
723,c5JQp6xafqc,2228669,34566,849,0,7194,2021-10-13 09:50:03,공범 EP1
1635,c5JQp6xafqc,2706691,37893,987,0,7410,2021-10-19 17:50:02,공범 EP1
1636,c5JQp6xafqc,2707933,37901,988,0,7410,2021-10-19 18:20:03,공범 EP1
1637,c5JQp6xafqc,2708448,37903,988,0,7410,2021-10-19 18:30:03,공범 EP1

In [360]:
# 16
target = video.copy()
target['date'] = target['ct'].dt.date
target.sort_values(['videoname','ct']).drop_duplicates('videoname',keep='first')[['date','videoname']]

             date videoname
10     2021-10-07    공범 EP1
3496   2021-10-09    공범 EP2
6696   2021-10-14    공범 EP3
9264   2021-10-16    공범 EP4
11544  2021-10-21    공범 EP5
13661  2021-10-23    공범 EP6
13106  2021-10-28    공범 EP7
14935  2021-10-30    공범 EP8

In [382]:
# 17

target = video[video.ct.dt.hour == 21]
target.sort_values(['videoname','ct']).drop_duplicates('videoname',keep='first')\
    .sort_values('videoname', ascending=False)[['videoname','viewcnt','ct']]
# target.sort_values('videoname', ascending=False).sort_values('ct').drop_duplicates('videoname',keep='first').

      videoname  viewcnt                  ct
14945    공범 EP8   264029 2021-10-30 21:00:08
13117    공범 EP7   252032 2021-10-28 21:00:04
13672    공범 EP6   213899 2021-10-23 21:00:06
11555    공범 EP5   201179 2021-10-21 21:00:04
9275     공범 EP4   217674 2021-10-16 21:00:04
6707     공범 EP3   147183 2021-10-14 21:00:04
3507     공범 EP2   148144 2021-10-09 21:00:03
21       공범 EP1   117340 2021-10-07 21:00:03

In [383]:
video

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1
...,...,...,...,...,...,...,...,...
15196,yZt-h-KcmUE,1285474,25582,3615,0,31603,2021-11-01 14:50:06,공범 EP8
15197,yZt-h-KcmUE,1286376,25592,3617,0,31627,2021-11-01 15:00:05,공범 EP8
15198,yZt-h-KcmUE,1287172,25597,3619,0,31643,2021-11-01 15:10:05,공범 EP8
15199,yZt-h-KcmUE,1288138,25606,3619,0,31648,2021-11-01 15:20:04,공범 EP8
15200,yZt-h-KcmUE,1289088,25616,3621,0,31663,2021-11-01 15:30:05,공범 EP8

In [390]:
# 18

target = video.sort_values(['videoname','ct']).drop_duplicates('videoname',keep='last')
target['ratio'] = target['dislikecnt']/target['likecnt']
target[['videoname','ratio']].sort_values(by='ratio')

      videoname     ratio
13660    공범 EP7  0.013636
14934    공범 EP6  0.015881
11543    공범 EP4  0.017971
13105    공범 EP5  0.021128
9263     공범 EP3  0.022360
3491     공범 EP1  0.027118
6695     공범 EP2  0.029844
15200    공범 EP8  0.141357

In [429]:
# 19
def solution(x):
    result =  max(x) - min(x) 
    return result

con1 = video['ct'] >= pd.to_datetime('2021-11-01 00:00:00')
con2 = video['ct'] <= pd.to_datetime('2021-11-01 15:00:00')
target = video[con1 & con2]
target[['videoname','viewcnt']].groupby('videoname').agg(solution)

           viewcnt
videoname
 공범 EP1      13298
 공범 EP2      10300
 공범 EP3       9927
 공범 EP4       9824
 공범 EP5      10824
 공범 EP6      14141
 공범 EP7      26949
 공범 EP8      89147

In [433]:
# 20 
video[video.duplicated()][['videoname','ct']]

     videoname                  ct
722     공범 EP1 2021-10-13 09:41:37
3927    공범 EP2 2021-10-13 09:41:37

### 월드컵 출전선수 골기록 데이터

In [60]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/worldcup/worldcupgoals.csv')
df.head()

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany
3   Just Fontaine     13                 1958   France
4            Pele     12  1958-1962-1966-1970   Brazil

In [61]:
# 21
# df[['Country','Goals']].sort_values(by = 'Goals', ascending=False).head()
df[['Country','Goals']].groupby('Country').sum().sort_values(by='Goals',ascending=False).head()

           Goals
Country
Brazil       228
Germany      226
Argentina    135
Italy        123
France       115

In [62]:
# 22 
df[['Player','Country']].drop_duplicates().groupby('Country').size().sort_values(ascending=False).head()

Country
Brazil       80
Germany      78
Italy        60
Argentina    59
France       58
dtype: int64

In [63]:
# 23
(df['Years'].map(lambda x: len(x.split('-')[0])) != 4).sum()

45

In [64]:
# 24 
df2 = df[df['Years'].map(lambda x: len(x.split('-')[0])) == 4]

# len(df2)
df2.shape[0]

1250

In [65]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1250 entries, 0 to 1294
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Player   1250 non-null   object
 1   Goals    1250 non-null   int64
 2   Years    1250 non-null   object
 3   Country  1250 non-null   object
dtypes: int64(1), object(3)
memory usage: 48.8+ KB

In [68]:
# 25
df2['LenCup'] = df2['Years'].map(lambda x: len(x.split('-')))

(df2['LenCup'] == 4).sum()

C:\Users\user\AppData\Local\Temp\ipykernel_17908\3982101108.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['LenCup'] = df2['Years'].map(lambda x: len(x.split('-')))

16

In [72]:
# 26 
con1 = df2['Country'] == 'Yugoslavia'
con2 = df2['LenCup'] == 2
df2[con1 & con2].shape[0]

7

In [82]:
# 27
df['Years'].str.contains('2002').sum()

156

In [89]:
# 28

# df2['Player'].str.contains('Carlos').sum()
df2['Player'].str.lower().str.contains('carlos').sum()

13

In [100]:
# 29
df2[df2['LenCup'] == 1].sort_values('Goals',ascending=False).iloc[0,0]

'Just Fontaine'

In [111]:
# 30 
# df2[df2['LenCup'] == 1].groupby('Country').size().sort_values(ascending=False).index[0]
df2[df2['LenCup'] == 1].Country.value_counts().index[0]

'Brazil'

### 서울시 따릉이 이용정보 데이터

In [14]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')

In [15]:
# 31
result = df['대여일자'].value_counts().sort_index().to_frame()
answer = result[result.values == result.values.max()].index[0]
display(result)
print(answer)

            count
대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

2021-06-04

In [16]:
# 32
df['day_name'] = pd.to_datetime(df['대여일자']).dt.day_name()
df['day_name'].value_counts()

day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977
Name: count, dtype: int64

In [17]:
# 33 > 까다로웠음 
result = df.groupby(['day_name','대여소번호']).size().to_frame('size').sort_values(['day_name','size'],ascending=False).reset_index()
answer = result.drop_duplicates('day_name',keep='first').reset_index(drop=True)
display(result)
print(answer)

        day_name  대여소번호  size
0      Wednesday    502   282
1      Wednesday    207   257
2      Wednesday   2102   253
3      Wednesday   2715   253
4      Wednesday    152   223
...          ...    ...   ...
16869     Friday   3878     1
16870     Friday   4523     1
16871     Friday   9980     1
16872     Friday   9997     1
16873     Friday   9998     1

[16874 rows x 3 columns]

    day_name  대여소번호  size
0  Wednesday    502   282
1    Tuesday    502   267
2   Thursday   2715   137
3     Sunday    502   372
4   Saturday    502   378
5     Monday    502   242
6     Friday    502   277

In [18]:
df['대여구분코드'].value_counts()

대여구분코드
정기권         555593
일일권         120328
단체권           3018
일일권(비회원)        11
Name: count, dtype: int64

In [19]:
# 34
## 현정코드 
# df1 = df.groupby('연령대코드').size().to_frame('전체횟수').reset_index()
# df2 = df[df['대여구분코드'].str.contains('일일권')].groupby('연령대코드').size().to_frame('일일권').reset_index()
# target = pd.merge(df1,df2,how='inner')
# target['R'] = target['일일권']/target['전체횟수']
# target[['연령대코드','R']].sort_values(by='R',ascending=False)

## 답지  
daily = df[df['대여구분코드'].isin(['일일권','일일권(비회원)'])].연령대코드.value_counts().sort_index()
total = df.연령대코드.value_counts().sort_index()

(daily/total).sort_values(ascending=False)

연령대코드
~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
Name: count, dtype: float64

In [20]:
# 35
df.groupby('연령대코드')['이동거리'].mean()

연령대코드
20대     3211.890552
30대     3341.443859
40대     3514.857416
50대     3593.668100
60대     3538.145737
70대~    3085.039641
~10대    2634.426279
Name: 이동거리, dtype: float64

In [21]:
# 36
t1 = df[(df['연령대코드'] == '20대')]
t2 = t1[t1['이동거리'] >= t1['이동거리'].mean()].sort_values(by=['대여일자', '대여소번호'], ascending=False).reset_index().iloc[:200, :]
round(t2['탄소량'].map(lambda x: float(x)).mean(),3)

1.613

In [22]:
# 37
df[(df['대여일자'] == '2021-06-07') & (df['연령대코드'] == '~10대')].이용건수.median()

1.0

In [23]:
# 38
# t = df[df.day_name.isin(['Tuesday', 'Wednesday', 'Thursday', 'Friday','Monday'])]
# df_8 = t[t['대여시간'] == 8].groupby(['대여시간','대여소번호']).size().to_frame('이용횟수').sort_values(by='이용횟수',ascending=False).head(3)
# df_7 = t[t['대여시간'] == 7].groupby(['대여시간','대여소번호']).size().to_frame('이용횟수').sort_values(by='이용횟수',ascending=False).head(3)
# df_6 = t[t['대여시간'] == 6].groupby(['대여시간','대여소번호']).size().to_frame('이용횟수').sort_values(by='이용횟수',ascending=False).head(3)

# a = pd.concat([df_8, df_7, df_6],axis=1).fillna(0)
# a.sum(axis=1).to_frame('이용횟수')


target = df[(df.day_name.isin(['Tuesday', 'Wednesday', 'Thursday', 'Friday','Monday'])) & (df.대여시간.isin([6,7,8]))]
result = target.groupby(['대여시간','대여소번호']).size().to_frame('이용 횟수')

result.sort_values(['대여시간','이용 횟수'], ascending=False).groupby('대여시간').head(3)

            이용 횟수
대여시간 대여소번호
8    2701     119
     646      115
     1152      92
7    259      104
     230       77
     726       77
6    2744      45
     1125      40
     1028      36

In [24]:
# 39
df[df['이동거리'] >= df['이동거리'].mean()].이동거리.std()

5092.139707505356

In [27]:
# 40
# df['성별'].isin(['F','f'])
# df['성별'].map(lambda x: x.isin['F','f'])    

df['sex'] = df['성별'].map(lambda x: '남' if x in ['m','M'] else '여')
df.groupby('sex')['이동거리'].mean().to_frame()

            이동거리
sex
남    3209.110871
여    3468.575025

### 전세계 행복도 지표 데이터

In [1]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/happy2/happiness.csv')
df.head()

,행복랭킹,나라명,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식,년도
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393,2019
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410,2019
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341,2019
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118,2019
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298,2019

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   행복랭킹      312 non-null    int64
 1   나라명       312 non-null    object
 2   점수        312 non-null    float64
 3   상대GDP     312 non-null    float64
 4   사회적지원     312 non-null    float64
 5   행복기대치     312 non-null    float64
 6   선택의 자유도   312 non-null    float64
 7   관대함       312 non-null    float64
 8   부패에 대한인식  311 non-null    float64
 9   년도        312 non-null    int64
dtypes: float64(7), int64(2), object(1)
memory usage: 24.5+ KB

In [3]:
# 41
df[df['행복랭킹'] == 10].점수.mean()

7.259

In [4]:
# 42
df[df['행복랭킹'] <= 50].groupby('년도').점수.mean().to_frame('점수')
# df[df.행복랭킹<=50][['년도','점수']].groupby('년도').mean()

           점수
년도
2018  6.64678
2019  6.67002

In [5]:
df[df.년도 ==2018][['점수','부패에 대한인식']]

        점수  부패에 대한인식
156  7.632     0.393
157  7.594     0.340
158  7.555     0.408
159  7.495     0.138
160  7.487     0.357
..     ...       ...
307  3.355     0.064
308  3.303     0.097
309  3.254     0.106
310  3.083     0.038
311  2.905     0.076

[156 rows x 2 columns]

In [6]:
# 43
df[df['년도'] == 2018][['점수','부패에 대한인식']].corr().iloc[1,0]

0.40529152271510027

In [7]:
# 44 > for 문 돌리다가 답지봄 ㅎㅋ
len(df[['행복랭킹','나라명']]) - len(df[['행복랭킹','나라명']].drop_duplicates())

15

In [29]:
# 45 > 답지봄 ㅠㅠ
result = df[df.년도 == 2019].corr(numeric_only=True).unstack().to_frame().reset_index().dropna()
result = result[result[0] != 1].sort_values(by=0, ascending=False).drop_duplicates(0).head(5).reset_index(drop=True)
result.columns = ['v1','v2','v3']
result

      v1     v2        v3
0  행복기대치  상대GDP  0.835462
1  상대GDP     점수  0.793883
2  행복기대치     점수  0.779883
3  사회적지원     점수  0.777058
4  사회적지원  상대GDP  0.754906

In [45]:
# 46
target = df[['점수','년도']].sort_values(by=['년도','점수']).groupby('년도').head(5)
target.groupby('년도').mean()

          점수
년도
2018  3.1800
2019  3.1408

In [57]:
# 47
con1 = df['년도'] == 2019
GDP_m = df[df['년도'] == 2019].상대GDP.mean()
df[con1 & (df['상대GDP'] >= GDP_m)].점수.mean() - df[con1 & (df['상대GDP'] <= GDP_m)].점수.mean()

1.390483957219251

In [74]:
# 48
target = df.sort_values(['년도','부패에 대한인식'], ascending=False).groupby('년도').head(20).reset_index(drop=True)
target[['년도','부패에 대한인식']].groupby('년도').mean()

      부패에 대한인식
년도
2018    0.3267
2019    0.3201

In [103]:
# 49 
# 현정방법
# 50 - df[df['행복랭킹'] <= 50][['나라명']].duplicated().sum()

# sol
target = set(df[(df.년도 == 2019) & (df['행복랭킹'] <= 50)].나라명) - set(df[(df.년도 == 2018) & (df['행복랭킹'] <= 50)].나라명)
len(target)

4

In [153]:
# 50 > 답지참고 ㅠㅠ 
count = df.나라명.value_counts() 
target = count[count >=2].index
df2 = df.copy()
multiple = df2[df2.나라명.isin(target)].reset_index(drop=True)
multiple.loc[multiple['년도'] == 2018,'점수'] = multiple.loc[multiple['년도'] == 2018,'점수'] * (-1)
result = multiple.groupby('나라명')['점수'].sum().sort_values().to_frame().iloc[-1]
result

점수    0.87
Name: Burundi, dtype: float64

### 지역구 에너지 소비량 데이터

In [1]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/consum/Tetuan%20City%20power%20consumption.csv')
df.tail()

,DateTime,Temperature,Humidity,Wind Speed,general diffuse flows,diffuse flows,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption
52411,12/30/2017 23:10,7.010,72.4,0.080,0.040,0.096,31160.45627,26857.31820,14780.31212
52412,12/30/2017 23:20,6.947,72.6,0.082,0.051,0.093,30430.41825,26124.57809,14428.81152
52413,12/30/2017 23:30,6.900,72.8,0.086,0.084,0.074,29590.87452,25277.69254,13806.48259
52414,12/30/2017 23:40,6.758,73.0,0.080,0.066,0.089,28958.17490,24692.23688,13512.60504
52415,12/30/2017 23:50,6.580,74.1,0.081,0.062,0.111,28349.80989,24055.23167,13345.49820

In [2]:
# 51 
# df['DateTime'].map(lambda x: int(x.split('/')[0])).value_counts().sort_index()
df['DateTime'] = pd.to_datetime(df['DateTime'])
df['DateTime'].dt.month.value_counts().sort_index().to_frame()

          count
DateTime
1          4464
2          4032
3          4464
4          4320
5          4464
6          4320
7          4464
8          4464
9          4320
10         4464
11         4320
12         4320

In [3]:
# 52
target = df[df['DateTime'].dt.month == 3]
target.groupby(target['DateTime'].dt.hour)['Temperature'].mean().sort_values().iloc[0]
# target.groupby(target.DateTime.dt.hour)['Temperature'].mean().sort_values().values[0]

11.506612903225806

In [4]:
# 53
target = df[df['DateTime'].dt.month == 3]
target.groupby(target['DateTime'].dt.hour)['Temperature'].mean().sort_values(ascending=False).iloc[0]

18.393602150537635

In [5]:
# 54
df[df['Zone 1 Power Consumption'] > df['Zone 2  Power Consumption']].Humidity.mean()

68.23624448055052

In [6]:
# 55
# df[['Zone 1 Power Consumption','Zone 2  Power Consumption','Zone 3  Power Consumption']].corr()
df.iloc[:,-3:].corr()

,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption
Zone 1 Power Consumption,1.000000,0.834519,0.750733
Zone 2 Power Consumption,0.834519,1.000000,0.570932
Zone 3 Power Consumption,0.750733,0.570932,1.000000

In [23]:
# 56
# result = []
# for i in range(len(df)):
#     tmp = df['Temperature'][i]
#     if tmp < 10:
#         result.append('A')
#     elif tmp < 20:
#         result.append('B')
#     elif tmp < 30:
#         result.append('C')
#     else:
#         result.append('D')

# result.to_frame()

# df['tmp'] = df['Temperature']
# for i in range(len(df)):
#     tmp = df['Temperature'][i]
#     if tmp < 10:
#         # result.append('A')
#         df['tmp'][i] = 'A'
#     elif tmp < 20:
#         df['tmp'][i] = 'B'
#     elif tmp < 30:
#         df['tmp'][i] = 'C'
#     else:
#         df['tmp'][i] = 'D'
        
# df['tmp'].value_counts()
def ct(x):
    if x < 10:
        return 'A'
    elif x < 20:
        return 'B'
    elif x < 30:
        return 'C'
    else:
        return 'D'
        
df['sp'] = df['Temperature'].map(ct)
df['sp'] .value_counts().sort_index()

sp
A     2874
B    26993
C    21105
D     1444
Name: count, dtype: int64

In [32]:
# 57
# df['DateTime'].dt.month == 6
# df['DateTime'].dt.hour == 12
df[(df['DateTime'].dt.month == 6) & (df['DateTime'].dt.hour == 12)].Temperature.std()

2.0499417827951025

In [33]:
# 58
df[(df['DateTime'].dt.month == 6) & (df['DateTime'].dt.hour == 12)].Temperature.var()

4.202261312849163

In [37]:
# 59
df[df['Temperature'] >= df['Temperature'].mean()].sort_values('Temperature').iloc[3,2]

87.9

In [43]:
# 60
df[df['Temperature'] >= df['Temperature'].median()].sort_values('Temperature').iloc[3,2]

80.3

###  포켓몬 정보 데이터

In [1]:
import pandas as pd 

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/pok/Pokemon.csv')
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [2]:
# 61
target = df.groupby("Legendary").HP.mean().to_frame()
# (target.values[1] - target.values[0])[0]
result = target.values[1] - target.values[0]
print(result)

[25.55614861]

In [3]:
# 62 
result = df['Type 2'].value_counts().index[0]
result

'Flying'

In [4]:
# 63
target = df[df['Type 1'] == df['Type 1'].value_counts().index[0]]
target.Attack.mean()/target.Defense.mean()

1.0165238678090576

In [5]:
# 64
# 현정풀이
# df.groupby('Generation').Legendary.sum().sort_values().index[-1]

df[df.Legendary == True].Generation.value_counts().index[0]

3

In [6]:
# 65
target = df[['HP','Attack','Defense','Sp. Atk','Sp. Def','Speed']].corr().unstack().reset_index().rename(columns={0: 'corr'})
target[target['corr'] != 1].sort_values('corr', ascending=False).iloc[0]

level_0     Sp. Def
level_1     Defense
corr       0.510747
Name: 26, dtype: object

In [7]:
# 66
target = df.sort_values(by=['Generation','Attack']).groupby('Generation').head(3)
target.Attack.mean()

19.5

In [8]:
# 67 >> 답지참고 어려움 ㅠㅠ 
df.sort_values(by=['Generation','Attack'],ascending=False).groupby('Generation').head(5).Attack.mean()

157.23333333333332

In [9]:
# 68 
df[['Type 1','Type 2']].value_counts().head(1)

Type 1  Type 2
Normal  Flying    24
Name: count, dtype: int64

In [10]:
#69
# df.groupby(['Type1','Type2']).count()
target = df[['Type 1','Type 2']].value_counts().to_frame()

target[target['count'] == 1].shape[0]

39

In [16]:
# 70
target = df[['Type 1','Type 2']].value_counts().to_frame()
target2 = target[target['count'] == 1]

target2
lst = []
for value in target2.reset_index().values:

    sp = df[(df['Type 1'] == value[0]) & (df['Type 2'] == value[1])]
    lst.append(sp)
# lst

pd.concat(lst).Generation.value_counts().sort_index()

Generation
1     1
2     4
3     5
4    13
5     7
6     9
Name: count, dtype: int64

### 대한민국 체력장 데이터

In [42]:
import pandas as pd 

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/body/body.csv')
df.head()

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B
2,27.0,M,176.6,84.8,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B
3,38.0,M,167.6,76.7,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A
4,21.0,M,165.2,66.2,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C

In [43]:
# 71
(df['수축기혈압(최고) : mmHg'] - df['이완기혈압(최저) : mmHg']).mean()

52.19539414750672

In [44]:
#72

df[(df['측정나이'] >= 50) & (df['측정나이'] <= 59)]['신장 : cm'].mean()

164.07490107405314

In [45]:
# 73
df['연령대'] = df['측정나이']//10 * 10
df['연령대'].value_counts()

연령대
20.0    5831
30.0    2660
40.0    1801
50.0    1769
60.0    1335
Name: count, dtype: int64

In [47]:
# 74
# df[['연령대', '등급']].value_counts().reset_index()

df.groupby(['연령대','등급'],as_index=False).size()

     연령대 등급  size
0   20.0  A  1585
1   20.0  B  1443
2   20.0  C  1455
3   20.0  D  1348
4   30.0  A   743
5   30.0  B   697
6   30.0  C   626
7   30.0  D   594
8   40.0  A   386
9   40.0  B   428
10  40.0  C   455
11  40.0  D   532
12  50.0  A   321
13  50.0  B   410
14  50.0  C   474
15  50.0  D   564
16  60.0  A   314
17  60.0  B   371
18  60.0  C   339
19  60.0  D   311

In [61]:
# 75

target = df[df['측정회원성별'] == 'M']

abs(target[target['등급'] == 'A']['체지방율 : %'].mean() - target[target['등급'] == 'D']['체지방율 : %'].mean())

7.932086486137521

In [66]:
# 76
target = df[df['측정회원성별'] == 'F']
abs(target[target['등급'] == 'A']['체중 : kg'].mean() - target[target['등급'] == 'D']['체중 : kg'].mean())

5.176211590296504

In [79]:
# 77 
df['bmi'] = df['체중 : kg']/((df['신장 : cm']/100) ** 2)
df
df[df['측정회원성별'] == 'M'].bmi.mean()

24.46134409819308

In [85]:
# 78

df[df['bmi'] < df['체지방율 : %']]['체중 : kg'].mean()

61.7408806392542

In [90]:
# 79
df[df['측정회원성별'] == 'M']['악력D : kg'].mean() - df[df['측정회원성별'] == 'F']['악력D : kg'].mean()

17.55954185047464

In [94]:
# 80
df[df['측정회원성별'] == 'M']['교차윗몸일으키기 : 회'].mean() - df[df['측정회원성별'] == 'F']['교차윗몸일으키기 : 회'].mean()

14.243156833157627

### 기온 강수량 데이터

In [98]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/weather/weather2.csv')
df.head()

                  time  이화동강수  이화동기온  수영동강수  수영동기온
0  2020-01-01 00:00:00    0.1   -3.9    0.0    2.5
1  2020-01-01 01:00:00    0.0   -3.1    0.0    3.4
2  2020-01-01 02:00:00    0.0   -1.8    0.0    3.8
3  2020-01-01 03:00:00    0.0   -0.8    0.0    4.6
4  2020-01-01 04:00:00    0.0   -0.1    0.0    5.1

In [114]:
# 81
# df['time'] = pd.to_datetime(df['time'])
target = df[(df['time'].dt.month == 6) | (df['time'].dt.month == 7) | (df['time'].dt.month == 8)]

target[target['이화동기온'] > target['수영동기온']].shape[0]

1415

In [123]:
# 82
# con1 = df['이화동강수'] == df['이화동강수'].max()
# con2 = df['수영동강수'] == df['수영동강수'].max()
# df[con1 | con2].time

answer1 = df.loc[df['이화동강수'] == df['이화동강수'].max()].time.values
answer2 = df.loc[df['수영동강수'] == df['수영동강수'].max()].time.values

print(answer1, answer2)

['2020-09-30T09:00:00.000000000'] ['2020-07-23T12:00:00.000000000']

### 서비스 이탈예측 데이터

In [126]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv')
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,6842,15793491,Cherkasova,714,Germany,Male,26,3,119545.48,2,1,0,65482.94,0
1,8963,15607874,Keane,687,France,Male,38,0,144450.58,1,0,1,137276.83,0
2,7047,15737627,Rivero,589,Germany,Female,20,2,121093.29,2,1,0,3529.72,0
3,7503,15697844,Whitehouse,721,Spain,Female,32,10,0.00,1,1,0,136119.96,1
4,3439,15722404,Carpenter,445,France,Female,30,3,0.00,2,1,1,127939.19,0

In [140]:
# 83
df[df['Gender'] == 'Male'].groupby('Geography').Exited.sum().sort_values(ascending=False).head(1)

Geography
Germany    287
Name: Exited, dtype: int64

In [150]:
# 84
round(df[(df['HasCrCard'] == 1) & (df['IsActiveMember'] == 1)].Age.mean(),4)

39.6102

In [151]:
# 85
round(df[df['Balance'] >=df['Balance'].median()].CreditScore.std(),3)

97.295

### 성인 건강검진 데이터

In [154]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/smoke/train.csv')
df.head()

,성별코드,연령대코드(5세단위),신장(5Cm단위),체중(5Kg단위),허리둘레,시력(좌),시력(우),청력(좌),청력(우),수축기혈압,...,혈색소,요단백,혈청크레아티닌,(혈청지오티)AST,(혈청지오티)ALT,감마지티피,흡연상태,구강검진수검여부,치아우식증유무,치석
0,F,55,145,55,73.0,0.7,0.5,1.0,1.0,129.0,...,12.9,1.0,0.9,172.0,209.0,15.0,0,Y,0.0,Y
1,M,40,180,55,74.0,1.5,1.5,1.0,1.0,102.0,...,15.6,1.0,0.8,30.0,19.0,23.0,1,Y,0.0,Y
2,F,55,150,50,72.0,1.0,0.2,1.0,1.0,116.0,...,14.1,1.0,1.0,31.0,19.0,10.0,0,Y,0.0,N
3,M,40,170,85,89.0,1.0,0.8,1.0,1.0,124.0,...,16.7,1.0,1.0,26.0,38.0,108.0,1,Y,1.0,Y
4,F,40,155,45,62.0,0.5,1.0,1.0,1.0,127.0,...,12.9,1.0,0.7,20.0,11.0,13.0,0,Y,0.0,N

In [156]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44553 entries, 0 to 44552
Data columns (total 26 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   성별코드         44553 non-null  object
 1   연령대코드(5세단위)  44553 non-null  int64
 2   신장(5Cm단위)    44553 non-null  int64
 3   체중(5Kg단위)    44553 non-null  int64
 4   허리둘레         44553 non-null  float64
 5   시력(좌)        44553 non-null  float64
 6   시력(우)        44553 non-null  float64
 7   청력(좌)        44553 non-null  float64
 8   청력(우)        44553 non-null  float64
 9   수축기혈압        44553 non-null  float64
 10  이완기혈압        44553 non-null  float64
 11  식전혈당(공복혈당)   44553 non-null  float64
 12  총콜레스테롤       44553 non-null  float64
 13  트리글리세라이드     44553 non-null  float64
 14  HDL콜레스테롤     44553 non-null  float64
 15  LDL콜레스테롤     44553 non-null  float64
 16  혈색소          44553 non-null  float64
 17  요단백          44553 non-null  float64
 18  혈청크레아티닌      44553 non-null  float64
 19  (혈청지오티)AST   44553 non-null  float64
 20  (혈청지오티)ALT   44553 non-null  float64
 21  감마지티피        44553 non-null  float64
 22  흡연상태         44553 non-null  int64
 23  구강검진수검여부     44553 non-null  object
 24  치아우식증유무      44553 non-null  float64
 25  치석           44553 non-null  object
dtypes: float64(19), int64(4), object(3)
memory usage: 8.8+ MB

In [175]:
# 86
df['혈압차'] = df['수축기혈압'] - df['이완기혈압']
df['혈압차']
df.groupby('연령대코드(5세단위)')['혈압차'].var().sort_values(ascending=False).index[4]

60

In [180]:
# 87
df['WHtR'] = df['허리둘레']/df['신장(5Cm단위)']
m = len(df[(df['성별코드'] == 'M') & (df['WHtR'] >= 0.58)])
f = len(df[(df['성별코드'] == 'F') & (df['WHtR'] >= 0.58)])
m/f

# 답지풀이 > 비만을 먼저하고 성별 카운트
# df['비만']=df['허리둘레']/df['신장(5Cm단위)']
# data = df.loc[df['비만']>=0.58].성별코드.value_counts()
# answer = data['M']/data['F']
# print(answer)

1.1693877551020408

### 자동차 보험가입 예측데이터

In [185]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/insurance/train.csv')
df.head(10)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,188957,Female,25,1,17.0,1,< 1 Year,No,38785.0,152.0,59,0
1,275631,Male,20,1,22.0,0,< 1 Year,No,2630.0,160.0,113,0
2,329036,Female,40,1,41.0,0,1-2 Year,Yes,33165.0,124.0,188,0
3,227288,Female,28,1,30.0,1,< 1 Year,No,29038.0,152.0,233,0
4,300441,Female,50,1,28.0,0,1-2 Year,Yes,31325.0,124.0,258,0
5,5746,Male,44,1,29.0,0,1-2 Year,No,35039.0,152.0,148,0
6,162773,Female,22,1,15.0,1,< 1 Year,No,34423.0,160.0,199,0
7,123868,Male,61,1,11.0,1,1-2 Year,No,47010.0,26.0,233,0
8,329179,Female,32,1,15.0,0,< 1 Year,Yes,31325.0,154.0,54,1
9,358269,Female,53,1,28.0,1,1-2 Year,No,40948.0,26.0,146,0

In [194]:
# 88 
target = df[df['Vehicle_Age'] == '> 2 Years']
target[target['Annual_Premium'] >= target['Annual_Premium'].median()].Vintage.mean()

154.55906743858552

In [207]:
# 89
# df.pivot_table(index='Vehicle_Age', columns='Gender',aggfunc='mean',fill_value='Annual_Premium')
# df.groupby(['Vehicle_Age','Gender']).Annual_Premium.mean().unstack()

target = df.groupby(['Vehicle_Age','Gender'],as_index=False)['Annual_Premium'].mean()
# target
target.pivot(index='Vehicle_Age',columns='Gender',values='Annual_Premium')

Gender             Female          Male
Vehicle_Age
1-2 Year     30762.245001  30413.088469
< 1 Year     29972.286702  30310.982212
> 2 Years    36108.366374  35303.870627

### 핸드폰 가격 예측데이터

In [210]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/mobile/train.csv')
df.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

In [240]:
# 90 
# target = df[['price_range','n_cores']].size()
target = df[['price_range','n_cores']].value_counts().reset_index()
target
target.sort_values(['price_range','count'], ascending=[True,False]).groupby('price_range').head(1).reset_index(drop=True)

# df[['price_range','n_cores']].groupby(['price_range','n_cores']).size().sort_values().groupby(level=0).tail(1)

   price_range  n_cores  count
0            0        2     69
1            1        4     76
2            2        4     73
3            3        5     70

In [264]:
# 91
target = df[df['price_range'] == 3].corr().unstack().reset_index().sort_values(by=0, ascending=False)
target[target[0] != 1].iloc[1]

level_0          pc
level_1          fc
0          0.635166
Name: 214, dtype: object

### 비행탑승 경험 만족도 데이터

In [266]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/airline/train.csv')
df.head()

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,Inflight wifi service,Departure/Arrival time convenient,Ease of Online booking,...,Inflight entertainment,On-board service,Leg room service,Baggage handling,Checkin service,Inflight service,Cleanliness,Departure Delay in Minutes,Arrival Delay in Minutes,satisfaction
0,55882,Male,Loyal Customer,42,Business travel,Business,473,1,1,3,...,5,5,5,5,3,5,3,3,0.0,satisfied
1,31906,Female,Loyal Customer,31,Business travel,Business,3271,4,4,4,...,3,3,5,5,3,4,3,1,5.0,satisfied
2,85481,Male,Loyal Customer,51,Personal Travel,Eco,214,5,0,5,...,3,4,4,4,4,4,3,2,0.0,satisfied
3,102134,Male,Loyal Customer,44,Business travel,Business,3097,1,1,3,...,4,4,4,4,3,4,5,0,0.0,satisfied
4,31580,Male,Loyal Customer,33,Business travel,Business,3286,1,1,1,...,4,2,5,2,5,1,4,0,0.0,satisfied

In [274]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83123 entries, 0 to 83122
Data columns (total 24 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   id                                 83123 non-null  int64
 1   Gender                             83123 non-null  object
 2   Customer Type                      83123 non-null  object
 3   Age                                83123 non-null  int64
 4   Type of Travel                     83123 non-null  object
 5   Class                              83123 non-null  object
 6   Flight Distance                    83123 non-null  int64
 7   Inflight wifi service              83123 non-null  int64
 8   Departure/Arrival time convenient  83123 non-null  int64
 9   Ease of Online booking             83123 non-null  int64
 10  Gate location                      83123 non-null  int64
 11  Food and drink                     83123 non-null  int64
 12  Online boarding                    83123 non-null  int64
 13  Seat comfort                       83123 non-null  int64
 14  Inflight entertainment             83123 non-null  int64
 15  On-board service                   83123 non-null  int64
 16  Leg room service                   83123 non-null  int64
 17  Baggage handling                   83123 non-null  int64
 18  Checkin service                    83123 non-null  int64
 19  Inflight service                   83123 non-null  int64
 20  Cleanliness                        83123 non-null  int64
 21  Departure Delay in Minutes         83123 non-null  int64
 22  Arrival Delay in Minutes           82867 non-null  float64
 23  satisfaction                       83123 non-null  object
dtypes: float64(1), int64(18), object(5)
memory usage: 15.2+ MB

In [298]:
# 92
target = df[df['Arrival Delay in Minutes'].isna()] # isnull()
target2 = target.groupby(['Class','satisfaction']).size().unstack()
target2[target2['neutral or dissatisfied'] < target2['satisfied']]

## 답지 
answer =df.loc[df['Arrival Delay in Minutes'].isnull()].groupby(['Class','satisfaction'],as_index=False).size().pivot(index='Class',columns='satisfaction')
answer
result =answer[answer['size']['neutral or dissatisfied'] < answer['size']['satisfied']]
result

                                size
satisfaction neutral or dissatisfied satisfied
Class
Business                          36        76

### 수질 음용성 여부 데이터

In [300]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/waters/train.csv')
df.head()

,ph,Hardness,Solids,Chloramines,Sulfate,Conductivity,Organic_carbon,Trihalomethanes,Turbidity,Potability
0,7.918150,214.186611,23823.492888,7.290878,341.173322,411.424483,19.585002,25.057375,4.028958,0
1,5.422446,205.266080,18542.957451,5.491963,306.702227,382.080129,10.504023,67.493450,2.911751,1
2,7.341547,187.672402,21273.457066,7.784003,NaN,332.084293,16.842334,55.019151,4.025644,0
3,9.056245,197.666301,17403.532167,7.688917,337.460176,414.766631,15.349869,63.696746,3.319354,0
4,5.039374,142.860598,40829.353167,7.271543,NaN,386.803057,16.823773,52.297113,4.957420,0

In [315]:
# 93
target = df['ph'].dropna()
target[target  <= target.quantile(0.25)].mean()

5.057093462441731

### 의료 비용 예측 데이터

In [317]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/train.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   64  female  39.330         0     no  northeast  14901.51670
1   47  female  27.830         0    yes  southeast  23065.42070
2   52  female  33.300         2     no  southwest  10806.83900
3   33  female  22.135         1     no  northeast   5354.07465
4   30    male  31.400         1     no  southwest   3659.34600

In [327]:

t_no = df.groupby('smoker').charges.quantile(0.9).values[0]
t_yes = df.groupby('smoker').charges.quantile(0.9).values[1]

r_no = df[(df['smoker'] == 'no') & (df['charges'] > t_no)].charges.mean()
r_yes = df[(df['smoker'] == 'yes') & (df['charges'] > t_yes)].charges.mean()

r_yes - r_no

29297.954548156144

### 킹카운티 주거지 가격예측문제 데이터

In [332]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/kingcountyprice//train.csv')
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,8961990160,20150413T000000,567500.0,3,2.5,2080,4556,2.0,0,0,...,8,2080,0,1999,0,98074,47.6036,-122.014,1530,5606
1,9455200205,20140604T000000,525000.0,3,2.0,1540,7800,1.0,0,0,...,8,1540,0,2004,0,98125,47.7041,-122.288,1510,7800
2,7853220670,20140918T000000,540000.0,3,2.5,2860,8935,2.0,0,0,...,8,2860,0,2004,0,98065,47.5336,-121.855,2650,6167
3,3298201170,20141110T000000,350000.0,3,1.0,940,7811,1.0,0,0,...,6,940,0,1959,0,98008,47.6195,-122.118,1180,7490
4,7972604355,20140521T000000,218000.0,3,1.0,1020,7874,1.0,0,0,...,7,1020,0,1956,0,98106,47.5175,-122.346,1290,7320

In [344]:
# 95

target = df[df['bedrooms'] == df['bedrooms'].value_counts().index[0]]
target.price.quantile(0.9) - target.price.quantile(0.1)

505500.0

### 대학원 입학가능성 데이터

In [345]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/admission/train.csv")
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,246,328,110,4,4.0,2.5,9.02,1,0.81
1,100,323,113,3,4.0,4.0,8.88,1,0.79
2,79,296,95,2,3.0,2.0,7.54,1,0.44
3,53,334,116,4,4.0,3.0,8.00,1,0.78
4,444,321,114,5,4.5,4.5,9.16,1,0.87

In [346]:
# 96 >> 머신러닝 데이터 문제인 것 같음ㅎ 

df[]

### 약물 분류 데이터

In [347]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/drug/train.csv")
df.head()

   Age Sex      BP Cholesterol  Na_to_K  Drug
0   20   F  NORMAL      NORMAL    9.281     4
1   24   M    HIGH      NORMAL    9.475     1
2   34   M  NORMAL        HIGH   22.456     0
3   17   M  NORMAL      NORMAL   10.832     4
4   72   M     LOW        HIGH   16.310     0

In [356]:
target = df[df['Sex'] == 'M']
target['Age2'] = target['Age']//10 * 10
target.groupby('Age2').Na_to_K.mean().to_frame()

C:\Users\user\AppData\Local\Temp\ipykernel_11756\2763409989.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  target['Age2'] = target['Age']//10 * 10

        Na_to_K
Age2
10    13.627000
20    18.260769
30    15.244143
40    13.897273
50    14.811273
60    14.284308
70    11.363857

### 사기회사 분류 데이터

In [357]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/audit/train.csv")
df.head()

,Sector_score,LOCATION_ID,PARA_A,Score_A,Risk_A,PARA_B,Score_B,Risk_B,TOTAL,numbers,...,RiSk_E,History,Prob,Risk_F,Score,Inherent_Risk,CONTROL_RISK,Detection_Risk,Audit_Risk,Risk
0,2.72,14,4.53,0.6,2.718,87.93,0.6,52.758,92.46,5.0,...,0.4,0,0.2,0.0,4.0,108.362,0.4,0.5,21.6724,1
1,3.41,16,12.68,0.6,7.608,41.00,0.6,24.600,53.68,5.5,...,0.4,0,0.2,0.0,4.4,41.936,0.4,0.5,8.3872,1
2,2.72,11,3.11,0.6,1.866,113.97,0.6,68.382,117.08,5.5,...,0.4,0,0.2,0.0,4.4,88.832,0.4,0.5,17.7664,1
3,3.41,8,1.12,0.4,0.448,0.00,0.2,0.000,1.12,5.0,...,0.4,0,0.2,0.0,2.2,1.848,0.4,0.5,0.3696,0
4,55.57,9,1.06,0.4,0.424,0.00,0.2,0.000,1.06,5.0,...,0.4,0,0.2,0.0,2.2,1.824,0.4,0.5,0.3648,0

In [361]:
# 99 
df.groupby('Risk')[['Score_A','Score_B']].mean()

       Score_A   Score_B
Risk
0     0.262234  0.225532
1     0.490164  0.444262

### 센서데이터 동작유형 분류 데이터

In [8]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/muscle/train.csv")
df.head()

,motion_0,motion_1,motion_2,motion_3,motion_4,motion_5,motion_6,motion_7,motion_8,motion_9,...,motion_55,motion_56,motion_57,motion_58,motion_59,motion_60,motion_61,motion_62,motion_63,pose
0,-6.0,8.0,5.0,6.0,-12.0,-27.0,5.0,24.0,-8.0,-5.0,...,-1.0,-3.0,-6.0,-9.0,-7.0,36.0,68.0,3.0,-3.0,1
1,-32.0,-3.0,-4.0,-5.0,-1.0,16.0,0.0,-5.0,42.0,2.0,...,-17.0,-12.0,-1.0,-1.0,0.0,-26.0,-11.0,-4.0,-9.0,1
2,35.0,-2.0,-1.0,1.0,-25.0,-16.0,-3.0,-20.0,10.0,1.0,...,6.0,-65.0,6.0,-10.0,-31.0,-19.0,-3.0,-47.0,-17.0,0
3,-15.0,-6.0,-3.0,-5.0,27.0,37.0,-2.0,-2.0,19.0,5.0,...,2.0,11.0,0.0,-2.0,-4.0,-7.0,15.0,3.0,14.0,1
4,60.0,3.0,0.0,-7.0,-6.0,-10.0,-6.0,7.0,-11.0,-4.0,...,-12.0,17.0,-3.0,1.0,2.0,-2.0,20.0,18.0,10.0,0

In [26]:
# 100
target = df.groupby('pose').median().T
target['diff'] = abs(target[0] - target[1])
# target.sort_values(by='diff', ascending=False)
target[target['diff'] == target['diff'].max()].index

Index(['motion_54', 'motion_62'], dtype='object')

### 현대 차량 가격 분류문제 데이터

In [27]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/hyundai/train.csv")
df.head()

,model,year,price,transmission,mileage,fuelType,tax(£),mpg,engineSize
0,Tucson,2016,12795,Manual,36263,Diesel,30,61.7,1.7
1,I10,2012,3995,Manual,22089,Petrol,20,61.4,1.2
2,I30,2019,24000,Manual,555,Petrol,145,34.0,2.0
3,Tucson,2017,12995,Manual,32147,Diesel,30,61.7,1.7
4,Tucson,2018,14991,Semi-Auto,32217,Diesel,150,57.6,1.7

In [50]:
# 101
# df['model'].value_counts().index[:3]
target = df[df['model'].isin(df['model'].value_counts().index[:3])]
target.groupby('model').price.mean().to_frame()

                price
model
 I10      7646.137891
 I30     11651.821759
 Tucson  15805.441373

### 당뇨여부판단 데이터

In [51]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/diabetes/train.csv")
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,3,102,74,0,0,29.5,0.121,32,0
1,2,144,58,33,135,31.6,0.422,25,1
2,5,136,82,0,0,0.0,0.640,69,0
3,13,145,82,19,110,22.2,0.245,57,0
4,1,117,60,23,106,33.8,0.466,27,0

In [62]:
# 102
target = df.groupby('Outcome').mean().T
abs(target[0] - target[1])

Pregnancies                  1.574159
Glucose                     29.943995
BloodPressure                3.202079
SkinThickness                2.952033
Insulin                     33.398645
BMI                          4.541437
DiabetesPedigreeFunction     0.143646
Age                          5.866939
dtype: float64

### 넷플릭스 주식 데이터

In [81]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/nflx/NFLX.csv")
df['Date'] = pd.to_datetime(df['Date'])
df.head()

        Date      Open      High       Low     Close  Adj Close     Volume
0 2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1 2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2 2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3 2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4 2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [86]:
#103
target = df[df['Date'].dt.month == 5]
target.groupby(df['Date'].dt.strftime('%Y-%m')).Open.mean().to_frame()

               Open
Date
2002-05    1.155833
2003-05    1.641497
2004-05    4.261143
2005-05    1.951905
2006-05    4.163571
2007-05    3.159351
2008-05    4.435034
2009-05    5.790571
2010-05   14.417071
2011-05   34.650272
2012-05   10.523247
2013-05   31.936429
2014-05   51.121292
2015-05   85.057429
2016-05   92.705715
2017-05  158.255455
2018-05  329.779541
2019-05  359.664548
2020-05  433.880499
2021-05  496.923996

### nba 선수 능력치 데이터

In [2]:
import pandas as pd 
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/nba/nba.csv",encoding='latin',sep=';')
df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Precious Achiuwa,C,22,TOR,73,28,23.6,3.6,8.3,...,0.595,2.0,4.5,6.5,1.1,0.5,0.6,1.2,2.1,9.1
1,2,Steven Adams,C,28,MEM,76,75,26.3,2.8,5.1,...,0.543,4.6,5.4,10.0,3.4,0.9,0.8,1.5,2.0,6.9
2,3,Bam Adebayo,C,24,MIA,56,56,32.6,7.3,13.0,...,0.753,2.4,7.6,10.1,3.4,1.4,0.8,2.6,3.1,19.1
3,4,Santi Aldama,PF,21,MEM,32,0,11.3,1.7,4.1,...,0.625,1.0,1.7,2.7,0.7,0.2,0.3,0.5,1.1,4.1
4,5,LaMarcus Aldridge,C,36,BRK,47,12,22.3,5.4,9.7,...,0.873,1.6,3.9,5.5,0.9,0.3,1.0,0.9,1.7,12.9

In [6]:
# 104
round(df[df['Tm'] == 'TOR'].Age.mean(),4)

24.8696

In [10]:
# 105
df[df['Age'] == df['Age'].min()].Pos.value_counts().index[0]

'SG'

In [16]:
# 106
df['Player'].map(lambda x: x.split(' ')[0]).value_counts().head(1)

Player
Justin    14
Name: count, dtype: int64

In [18]:
# 107
df.groupby('Pos').PTS.mean().sort_values()

Pos
SF        7.270253
SG-SF     7.360000
C         7.690769
PF        7.737500
SG        7.810553
PG        8.325161
PF-SF     8.500000
SF-SG     8.660000
SG-PG     9.525000
C-PF     12.850000
PG-SG    22.000000
Name: PTS, dtype: float64

In [26]:
# 109
df[['Tm','G']].sort_values(['Tm','G'], ascending=False).groupby('Tm').head(1).G.mean()

77.51612903225806

In [35]:
# 110

df[(df['Tm'] == 'MIA') & ((df['Pos'] == 'C') | (df['Pos'] == 'PF'))].MP.mean()

16.7875

In [46]:
# 111
df[df['G'] >= (1.5*df['G'].mean())]['3P'].mean()

1.3853658536585365

In [51]:
# 112
df[df['Age'] >= df['Age'].mean()].G.mean() - df[df['Age'] < df['Age'].mean()].G.mean()

3.787674551781862

In [54]:
# 113
df.groupby('Tm').Age.mean().sort_values().index[0]

'MEM'

In [56]:
# 114
df.groupby('Pos').MP.mean()

Pos
C        16.990000
C-PF     25.350000
PF       17.937500
PF-SF    27.300000
PG       19.547742
PG-SG    37.200000
SF       17.514557
SF-SG    20.340000
SG       18.554271
SG-PG    22.950000
SG-SF    19.620000
Name: MP, dtype: float64